review_motivation = {

    5: [
       """Ты отлично поработал над этим заданием! Считаю, что это хорошая работа и решение выполнено верно, давай посмотрим подробнее /// Работа принята!""",
       """У меня нет правок к твоей работе, все супер! А теперь давай посмотрим детально /// Желаю удачи со следующими уроками и жду следующие домашки!""",
       """Я получил и проверил твою работу, она прекрасно реализована /// Принимаю твою работу и поздравляю с выполнением задания! Удачи в дальнейшем обучении!""",
       """Твоя работа выполнена на профессиональном уровне и я с удовольствием ее проверил. /// Работу принимаю. Удачи со следующими уроками!""",
       """Спасибо тебе за профессионально выполненную работу /// Все отлично, работа принята! Удачи в дальнейшем обучении!""",
       """Мне очень понравилась твоя работа. Давай посмотрим, как ты справился с задачами /// Все отлично, работа принята! Удачи в дальнейшем обучении!""",
       """Отличная работа! Ты хорошо освоил материал и справился со всеми заданиями. /// Твоя работа выполнена отлично, я с удовольствием принимаю её!""",
       """Ты провел фантастическую работу над заданием. Все требования к функционалу соблюдены! /// Твоя работа выполнена отлично, я с удовольствием принимаю её!""",
       """Спасибо за твою работу. Приятно видеть, что много усилий вложено ее выполнение. /// Все отлично, работа принята! Ты идешь в правильном направлении и я не сомневаюсь, что ты сможешь достичь больших успехов в дальнейшем обучении!""",
       """Мне очень понравилась твоя работа. Давай посмотрим, на нее подробнее:  /// Все отлично, работа принята! Удачи в дальнейшем обучении!""",
    ],

    4: [
       """Спасибо за твою работу, вижу, что ты проделал большой объем работы. У тебя всё получилось отлично, у меня буквально пара замечаний. /// Работа принята, поздравляю и удачи с дальнейшим обучением!""",
       """""",
    ],

    3: [
       """Я проверил твою работу и вижу, тебе удалось справиться почти со всеми задачами. Однако есть небольшой момент, который тебе стоит исправить /// Если исправить это, твоя работа будет поистине отличной. Жду от тебя исправленную версию работы!""",
       """Спасибо за отправленную работу. /// К сожалению, я не могу принять её в текущем виде.  Жду новую версию и всегда буду рад ответить на вопросы или помочь со сложностями!""",
       """Я вижу, что ты очень старался, делая эту работу. Вместе с тем я заметил некоторые моменты, которые можно улучшить. /// Уверен, у тебя получится!""",
       """Твоя работа сделана на достаточно хорошем уровне, но у меня есть есть пара предложений по улучшению. /// Пожалуйста, немного подправь и снова отправь работу на проверку и я ее приму. Буду рад помочь, если возникнут вопросы или сложности.""",
       """Ты проделал большую работу над программой. Однако обрати, пожалуйста, внимания на несколько пунктов, которые требуют доработки:  /// Я с нетерпением буду ждать твою исправленную работу и сразу же её приму. Продолжай в том же духе!""",
       """Привет, я получил и проверил твою работу. /// Отличная работа, осталось немного поправить и работа будет зачтена! Жду корректировку""",

    ],

    2: [
       """Я проверил твою работу и вижу, тебе удалось справиться почти со всеми задачами. Однако есть небольшой момент, который тебе стоит исправить /// Если исправить это, твоя работа будет поистине отличной. Жду от тебя исправленную версию работы!""",
       """Спасибо за отправленную работу. /// К сожалению, я не могу принять её в текущем виде.  Жду новую версию и всегда буду рад ответить на вопросы или помочь со сложностями!""",
       """Я вижу, что ты очень старался, делая эту работу. Вместе с тем я заметил некоторые моменты, которые можно улучшить. /// Уверен, у тебя получится!""",
       """Твоя работа сделана на достаточно хорошем уровне, но у меня есть есть пара предложений по улучшению. /// Пожалуйста, немного подправь и снова отправь работу на проверку и я ее приму. Буду рад помочь, если возникнут вопросы или сложности.""",
       """Ты проделал большую работу над программой. Однако обрати, пожалуйста, внимания на несколько пунктов, которые требуют доработки:  /// Я с нетерпением буду ждать твою исправленную работу и сразу же её приму. Продолжай в том же духе!""",
       """Я получил и проверил твою работу. /// Отличная работа, осталось немного поправить и работа будет зачтена! Жду корректировку""",

    ],

}
